
* Script.py

#+begin_src python :results output
import pandas as pd
import numpy as np

coffee = pd.read_csv('starbucks_customers.csv')
ages = coffee['age']

#find the mean of age and print it
print('mean of age: ', np.mean(ages))

#find the standard deviation of age and print it
print('stdev of age: ', np.std(ages))

#This will take each data point in age, subtract the mean and then divide by the standard deviation
age_standardized = (ages - np.mean(ages))/np.std(ages)

#Print the mean and standard deviation of age_standardized
print('mean of age_standardized', np.mean(age_standardized))
print('stdev of age_standardized', np.std(age_standardized))

#+end_src

#+RESULTS:
: mean of age:  27.33606557377049
: stdev of age:  9.428428111378789
: mean of age_standardized 1.7290358580227847e-16
: stdev of age_standardized 0.9999999999999999
